
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	МодульАДС = МодульАдминистрированиеДинамическихСписков();
	МодульАДС.ПриСозданииНаСервере(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	МодульАДС = МодульАдминистрированиеДинамическихСписковКлиент();
	МодульАДС.ПриОткрытии(ЭтотОбъект, Отказ);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	МодульАДС = МодульАдминистрированиеДинамическихСписковКлиент();
	МодульАДС.ПриЗакрытии(ЭтотОбъект, ЗавершениеРаботы);
	
КонецПроцедуры

&НаСервере
Процедура СписокПередЗагрузкойПользовательскихНастроекНаСервере(
	Элемент, Настройки, ИспользуютсяСтандартныеНастройки)
	
	МодульАДС = МодульАдминистрированиеДинамическихСписков();
	МодульАДС.ПередЗагрузкойПользовательскихНастроекНаСервере(
		ЭтотОбъект, Элемент, Настройки, ИспользуютсяСтандартныеНастройки);
		
КонецПроцедуры

&НаСервереБезКонтекста
Процедура СписокПриПолученииДанныхНаСервере(ИмяЭлемента, Настройки, Строки)
	
	МодульАДС = МодульАдминистрированиеДинамическихСписков();
	МодульАДС.ПриПолученииДанныхНаСервере(ИмяЭлемента, Настройки, Строки);
	
КонецПроцедуры

&НаКлиенте
Процедура ИТМ_ОбработатьНакопленныеСобытияОбновления() Экспорт
	
	МодульАДС = МодульАдминистрированиеДинамическихСписковКлиент();
	МодульАДС.ОбработатьНакопленныеСобытияОбновления(ЭтотОбъект);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция МодульАдминистрированиеДинамическихСписков()
	
	Возврат ОбщегоНазначения.ОбщийМодуль("ИТМ_АдминистрированиеДинамическихСписков");
	
КонецФункции

&НаКлиенте
Функция МодульАдминистрированиеДинамическихСписковКлиент()
	
	Возврат ОбщегоНазначенияКлиент.ОбщийМодуль("ИТМ_АдминистрированиеДинамическихСписковКлиент");
	
КонецФункции
      
