// @strict-types

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ШаблонПоискаРазделителя = ИТМ_АдминистрированиеДинамическихСписковКлиентСервер.РазделительФормыИЭлемента();
	ШаблонПоискаРазделителя = СтрШаблон("%1%2%1", "%", ШаблонПоискаРазделителя);
	Список.Параметры.УстановитьЗначениеПараметра("ШаблонПоискаРазделителя", ШаблонПоискаРазделителя);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписок

&НаКлиенте
Процедура СписокПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Отказ = Истина;	
	ОткрытьФорму("РегистрСведений.ИТМ_НастройкиДинамическихСписков.Форма.ФормаСозданияКлюча",,Элементы.Список);
	
КонецПроцедуры

// Список обработка выбора.
// 
// Параметры:
//  Элемент - ТаблицаФормы - Элемент
//  ВыбранноеЗначение - Число - Выбранное значение
//  СтандартнаяОбработка - Булево - Стандартная обработка
&НаКлиенте
Процедура СписокОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Элементы.Список.ТекущаяСтрока = ВыбранноеЗначение;
	
КонецПроцедуры

#КонецОбласти
