// @strict-types
// @skip-check module-empty-method

#Область СлужебныйПрограммныйИнтерфейс

// Выполняется перед событием подключенной формы списка "ПриОткрытии"
// 
// Параметры:
//  Форма	 - ФормаКлиентскогоПриложения - Управляемое форма
//  Отказ    - Булево - Признак отказа
//  НастройкиНаФорме - см. ИТМ_АдминистрированиеДинамическихСписковКлиентСервер.НастройкиНаФорме
//	СтандартнаяОбработка - Булево - Признак стандартной обработки для основной процедуры
// 
Процедура ПередВыполнениемПриОткрытии(Форма, Отказ, НастройкиНаФорме, СтандартнаяОбработка) Экспорт
	
	
	
КонецПроцедуры

// Выполняется после события подключенной формы списка "ПриОткрытии"
//
// Параметры:
//  Форма	 - ФормаКлиентскогоПриложения - Управляемое форма
//  Отказ    - Булево - Признак отказа
Процедура ПослеВыполненияПриОткрытии(Форма, Отказ) Экспорт
	
	
	
КонецПроцедуры

// Выполняется перед событием подключенной формы списка "ПриЗакрытии"
//
// Параметры:
//  Форма	 - ФормаКлиентскогоПриложения - Управляемое форма
//  ЗавершениеРаботы - Булево - Признак того, что форма закрывается в процессе завершения работы приложения
//	СтандартнаяОбработка - Булево - Признак стандартной обработки для основной процедуры
Процедура ПередВыполнениемПриЗакрытии(Форма, ЗавершениеРаботы, СтандартнаяОбработка) Экспорт
	
	
	
КонецПроцедуры

#КонецОбласти
